###################################################################

# Created by write_sdc on Tue Jul 23 16:17:59 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock [get_ports clock]  -name CLK  -period 10  -waveform {0 5}
set_clock_uncertainty 0.5  [get_clocks CLK]
set_input_delay -clock CLK  -max 1  [get_ports clock]
set_input_delay -clock CLK  -max 1  [get_ports reset]
set_input_delay -clock CLK  -max 1  [get_ports start]
set_input_delay -clock CLK  -max 1  [get_ports input(31)]
set_input_delay -clock CLK  -max 1  [get_ports input(30)]
set_input_delay -clock CLK  -max 1  [get_ports input(29)]
set_input_delay -clock CLK  -max 1  [get_ports input(28)]
set_input_delay -clock CLK  -max 1  [get_ports input(27)]
set_input_delay -clock CLK  -max 1  [get_ports input(26)]
set_input_delay -clock CLK  -max 1  [get_ports input(25)]
set_input_delay -clock CLK  -max 1  [get_ports input(24)]
set_input_delay -clock CLK  -max 1  [get_ports input(23)]
set_input_delay -clock CLK  -max 1  [get_ports input(22)]
set_input_delay -clock CLK  -max 1  [get_ports input(21)]
set_input_delay -clock CLK  -max 1  [get_ports input(20)]
set_input_delay -clock CLK  -max 1  [get_ports input(19)]
set_input_delay -clock CLK  -max 1  [get_ports input(18)]
set_input_delay -clock CLK  -max 1  [get_ports input(17)]
set_input_delay -clock CLK  -max 1  [get_ports input(16)]
set_input_delay -clock CLK  -max 1  [get_ports input(15)]
set_input_delay -clock CLK  -max 1  [get_ports input(14)]
set_input_delay -clock CLK  -max 1  [get_ports input(13)]
set_input_delay -clock CLK  -max 1  [get_ports input(12)]
set_input_delay -clock CLK  -max 1  [get_ports input(11)]
set_input_delay -clock CLK  -max 1  [get_ports input(10)]
set_input_delay -clock CLK  -max 1  [get_ports input(9)]
set_input_delay -clock CLK  -max 1  [get_ports input(8)]
set_input_delay -clock CLK  -max 1  [get_ports input(7)]
set_input_delay -clock CLK  -max 1  [get_ports input(6)]
set_input_delay -clock CLK  -max 1  [get_ports input(5)]
set_input_delay -clock CLK  -max 1  [get_ports input(4)]
set_input_delay -clock CLK  -max 1  [get_ports input(3)]
set_input_delay -clock CLK  -max 1  [get_ports input(2)]
set_input_delay -clock CLK  -max 1  [get_ports input(1)]
set_input_delay -clock CLK  -max 1  [get_ports input(0)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(31)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(30)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(29)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(28)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(27)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(26)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(25)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(24)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(23)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(22)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(21)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(20)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(19)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(18)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(17)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(16)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(15)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(14)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(13)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(12)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(11)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(10)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(9)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(8)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(7)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(6)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(5)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(4)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(3)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(2)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(1)]
set_output_delay -clock CLK  -max 1  [get_ports d_out(0)]
set_output_delay -clock CLK  -max 1  [get_ports rd_in]
set_output_delay -clock CLK  -max 1  [get_ports done]
