###################################################################

# Created by write_sdc on Thu Jul 18 14:55:53 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock [get_ports clock]  -name CLK  -period 10  -waveform {0 5}
set_clock_uncertainty 0.07  [get_clocks CLK]
set_input_delay -clock CLK  -max 0.5  [get_ports clock]
set_input_delay -clock CLK  -max 0.5  [get_ports reset]
set_input_delay -clock CLK  -max 0.5  [get_ports start]
set_input_delay -clock CLK  -max 0.5  [get_ports input(31)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(30)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(29)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(28)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(27)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(26)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(25)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(24)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(23)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(22)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(21)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(20)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(19)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(18)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(17)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(16)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(15)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(14)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(13)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(12)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(11)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(10)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(9)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(8)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(7)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(6)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(5)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(4)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(3)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(2)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(1)]
set_input_delay -clock CLK  -max 0.5  [get_ports input(0)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_ad0(4)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_ad0(3)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_ad0(2)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_ad0(1)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_ad0(0)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(127)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(126)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(125)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(124)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(123)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(122)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(121)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(120)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(119)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(118)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(117)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(116)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(115)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(114)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(113)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(112)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(111)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(110)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(109)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(108)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(107)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(106)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(105)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(104)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(103)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(102)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(101)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(100)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(99)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(98)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(97)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(96)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(95)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(94)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(93)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(92)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(91)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(90)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(89)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(88)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(87)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(86)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(85)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(84)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(83)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(82)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(81)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(80)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(79)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(78)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(77)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(76)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(75)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(74)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(73)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(72)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(71)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(70)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(69)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(68)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(67)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(66)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(65)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(64)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(63)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(62)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(61)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(60)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(59)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(58)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(57)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(56)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(55)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(54)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(53)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(52)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(51)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(50)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(49)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(48)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(47)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(46)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(45)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(44)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(43)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(42)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(41)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(40)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(39)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(38)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(37)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(36)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(35)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(34)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(33)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(32)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(31)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(30)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(29)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(28)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(27)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(26)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(25)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(24)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(23)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(22)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(21)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(20)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(19)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(18)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(17)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(16)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(15)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(14)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(13)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(12)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(11)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(10)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(9)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(8)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(7)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(6)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(5)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(4)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(3)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(2)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(1)]
set_input_delay -clock CLK  -max 0.5  [get_ports w_arr(0)]
set_output_delay -clock CLK  -max 0.5  [get_ports w_ad(4)]
set_output_delay -clock CLK  -max 0.5  [get_ports w_ad(3)]
set_output_delay -clock CLK  -max 0.5  [get_ports w_ad(2)]
set_output_delay -clock CLK  -max 0.5  [get_ports w_ad(1)]
set_output_delay -clock CLK  -max 0.5  [get_ports w_ad(0)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(31)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(30)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(29)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(28)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(27)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(26)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(25)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(24)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(23)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(22)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(21)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(20)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(19)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(18)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(17)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(16)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(15)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(14)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(13)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(12)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(11)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(10)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(9)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(8)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(7)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(6)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(5)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(4)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(3)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(2)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(1)]
set_output_delay -clock CLK  -max 0.5  [get_ports d_out(0)]
set_output_delay -clock CLK  -max 0.5  [get_ports rd_in]
set_output_delay -clock CLK  -max 0.5  [get_ports done]
